Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement.BendingAngle Property
 Gets or sets a value indicating whether to show the pull-out bending angles.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool BendingAngle { get; set; }
Public Property BendingAngle As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ReinforcementPulloutElement Class
Tekla.Structures.Drawing Namespace